scripts/artillery-load-test.yml
# Prueba de carga segura: solo endpoints de lectura.
# No autentica usuarios, no modifica fichas y no crea ordenes ni reservas.
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 15
      arrivalRate: 5
      name: 'Calentamiento'
    - duration: 45
      arrivalRate: 20
      name: 'Carga sostenida'
    - duration: 20
      arrivalRate: 20
      rampTo: 50
      name: 'Pico gradual'
  defaults:
    headers:
      Accept: 'application/json'

scenarios:
  - name: 'Exploracion publica del catalogo'
    flow:
      - get:
          url: '/api/health'
      - get:
          url: '/api/trips?limit=12'
          capture:
            - json: '$.trips[0].id'
              as: 'tripId'
      - think: 1
      - get:
          url: '/api/trips/{{ tripId }}'
      - get:
          url: '/api/trips/categories'
      - get:
          url: '/api/trips/filters'
      - think: 1
      - get:
          url: '/api/trips?limit=12&page=2'